MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_HAL_I2S_MODULE             |         1         | Enable the HAL I2S driver module
USE_HAL_I2S_REGISTER_CALLBACKS |         0         | Allow an application to define a callback
USE_HAL_I2S_DMA                |         1         | Enable the DMA code inside I2S
USE_HAL_CHECK_PARAM            |         0         | Enable runtime parameter check
USE_HAL_I2S_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_MUTEX                  |         0         | Enable semaphore creation for OS
USE_HAL_I2S_USER_DATA          |         0         | Add user data inside the HAL I2S handle
USE_HAL_I2S_GET_LAST_ERRORS    |         0         | Enable retrieving last process error codes
USE_HAL_I2S_OVR_UDR_ERRORS     |         0         | Enable retrieving overrun and underrun errors

Software configuration defined in preprocessor environment:
Preprocessor flags             |   Default value   | Comment
------------------------------ | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM           |    Not defined    | Enable parameter check for HAL and LL
USE_ASSERT_DBG_STATE           |    Not defined    | Enable state check for HAL
 */

/**
  * @}
  */

#if defined(USE_HAL_I2S_MODULE) && (USE_HAL_I2S_MODULE == 1)
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup I2S_Private_Constants I2S Private Constants
  * @{
  */

#define I2S_DEFAULT_TIMEOUT_MS  100U  /*!< Timeout default value */
#define I2S_FIFO_SIZE_BYTE      16U   /*!< Standard size 16-Bytes */
#define I2S_NUMBER_FREQUENCY    9U    /*!< Number of audio frequencies */

/* Private macro -------------------------------------------------------------*/
/** @defgroup I2S_Private_Macros I2S Private Macros
  * @{
  */

/** @brief  Ensure I2S Mode is valid.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE(mode) (((mode) == HAL_I2S_MODE_SLAVE_TX)             \
                           || ((mode) == HAL_I2S_MODE_SLAVE_RX)          \
                           || ((mode) == HAL_I2S_MODE_MASTER_TX)         \
                           || ((mode) == HAL_I2S_MODE_MASTER_RX)         \
                           || ((mode) == HAL_I2S_MODE_SLAVE_FULL_DUPLEX) \
                           || ((mode) == HAL_I2S_MODE_MASTER_FULL_DUPLEX))

/** @brief  Ensure I2S Mode is Full Duplex.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE_FULL_DUPLEX(mode) (((mode) == HAL_I2S_MODE_SLAVE_FULL_DUPLEX) \
                                       || ((mode) == HAL_I2S_MODE_MASTER_FULL_DUPLEX))

/** @brief  Ensure I2S Mode is Master.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE_MASTER(mode) (((mode) == HAL_I2S_MODE_MASTER_TX)    \
                                  || ((mode) == HAL_I2S_MODE_MASTER_RX) \
                                  || ((mode) == HAL_I2S_MODE_MASTER_FULL_DUPLEX))

/** @brief  Ensure I2S Mode is Slave.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE_SLAVE(mode) (((mode) == HAL_I2S_MODE_SLAVE_TX)    \
                                 || ((mode) == HAL_I2S_MODE_SLAVE_RX) \
                                 || ((mode) == HAL_I2S_MODE_SLAVE_FULL_DUPLEX))

/** @brief  Ensure I2S Mode is Transmit mode.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE_TX(mode) (((mode) == HAL_I2S_MODE_SLAVE_TX) \
                              || ((mode) == HAL_I2S_MODE_MASTER_TX))

/** @brief  Ensure I2S Mode is Receive mode.
  * @param  mode I2S communication mode (@ref hal_i2s_mode_t).
  * @retval 1 mode is a valid value.
  * @retval 0 mode is an invalid value.
  */
#define IS_I2S_MODE_RX(mode) (((mode) == HAL_I2S_MODE_SLAVE_RX) \
                              || ((mode) == HAL_I2S_MODE_MASTER_RX))

/** @brief  Ensure I2S Standard is valid.
  * @param  standard I2S audio standard (@ref hal_i2s_standard_t).
  * @retval 1 standard is a valid value.
  * @retval 0 standard is an invalid value.
  */
#define IS_I2S_STANDARD(standard) (((standard) == HAL_I2S_STANDARD_PHILIPS)      \
                                   || ((standard) == HAL_I2S_STANDARD_MSB)       \
                                   || ((standard) == HAL_I2S_STANDARD_LSB)       \
                                   || ((standard) == HAL_I2S_STANDARD_PCM_SHORT) \
                                   || ((standard) == HAL_I2S_STANDARD_PCM_LONG))

/** @brief  Ensure I2S Standard is PCM standard.
  * @param  standard I2S audio standard (@ref hal_i2s_standard_t).
  * @retval 1 standard is a valid value.
  * @retval 0 standard is an invalid value.
  */
#define IS_I2S_STANDARD_PCM(standard) (((standard) == HAL_I2S_STANDARD_PCM_SHORT) \
                                       || ((standard) == HAL_I2S_STANDARD_PCM_LONG))

/** @brief  Ensure I2S Data Format is valid.
  * @param  data_format I2S data format (@ref hal_i2s_data_format_t).
  * @retval 1 data_format is a valid value.
  * @retval 0 data_format is an invalid value.
  */
#define IS_I2S_DATA_FORMAT(data_format) (((data_format) == HAL_I2S_DATA_FORMAT_16_BIT)             \
                                         || ((data_format) == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED) \
                                         || ((data_format) == HAL_I2S_DATA_FORMAT_24_BIT)          \
                                         || ((data_format) == HAL_I2S_DATA_FORMAT_32_BIT))

/** @brief  Ensure I2S 32-Bits Data Format is valid.
  * @param  data_format I2S data format (@ref hal_i2s_data_format_t).
  * @retval 1 data_format is a valid value.
  * @retval 0 data_format is an invalid value.
  */
#define IS_I2S_CHANNEL_LENGTH_32_BIT(data_format) (((data_format) == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED) \
                                                   || ((data_format) == HAL_I2S_DATA_FORMAT_24_BIT)       \
                                                   || ((data_format) == HAL_I2S_DATA_FORMAT_32_BIT))

