MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
/** @brief  Ensure I2S Audio Frequency is valid.
  * @param  audio_frequency I2S audio frequency (@ref hal_i2s_master_audio_frequency_t).
  * @retval 1 audio_frequency is a valid value.
  * @retval 0 audio_frequency is an invalid value.
  */
#define IS_I2S_MASTER_AUDIO_FREQUENCY(audio_frequency) (((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_192_KHZ)   \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_96_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_48_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_44_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_32_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_22_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_16_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_11_KHZ) \
                                                        || ((audio_frequency) == HAL_I2S_MASTER_AUDIO_FREQ_8_KHZ))

/** @brief  Ensure I2S Clock Polarity is valid.
  * @param  clock_polarity I2S clock polarity (@ref hal_i2s_clock_polarity_t).
  * @retval 1 clock_polarity is a valid value.
  * @retval 0 clock_polarity is an invalid value.
  */
#define IS_I2S_CLOCK_POLARITY(clock_polarity) (((clock_polarity) == HAL_I2S_CLOCK_POLARITY_LOW) \
                                               || ((clock_polarity) == HAL_I2S_CLOCK_POLARITY_HIGH))

/** @brief  Ensure I2S Bit Order is valid.
  * @param  bit_order I2S bit order (@ref hal_i2s_bit_order_t).
  * @retval 1 bit_order is a valid value.
  * @retval 0 bit_order is an invalid value.
  */
#define IS_I2S_BIT_ORDER(bit_order) (((bit_order) == HAL_I2S_MSB_FIRST) \
                                     || ((bit_order) == HAL_I2S_LSB_FIRST))

/** @brief  Ensure I2S FIFO Threshold is valid.
  * @param  fifo_threshold I2S FIFO threshold (@ref hal_i2s_fifo_threshold_t).
  * @retval 1 fifo_threshold is a valid value.
  * @retval 0 fifo_threshold is an invalid value.
  */
#define IS_I2S_FIFO_THRESHOLD(fifo_threshold) (((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_1_DATA)    \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_2_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_3_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_4_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_5_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_6_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_7_DATA) \
                                               || ((fifo_threshold) == HAL_I2S_FIFO_THRESHOLD_8_DATA))

/** @brief  Ensure I2S transfer size is a multiplier of the FIFO Threshold.
  * @param  size_sample I2S transfer size.
  * @param  fifo_threshold I2S FIFO threshold (@ref hal_i2s_fifo_threshold_t),
  *                        must be different from HAL_I2S_FIFO_THRESHOLD_1_DATA.
  * @retval 1 size_sample is a valid value for fifo_threshold.
  * @retval 0 size_sample is an invalid value for fifo_threshold.
  */
#define IS_I2S_TRANSFER_SIZE(size_sample, fifo_threshold) (((size_sample) % (fifo_threshold)) == 0U)

/**
  * @brief Retrieve I2S instance from handle.
  * @param handle specifies the I2S handle.
  */
#define I2S_GET_INSTANCE(handle) ((SPI_TypeDef*)((uint32_t)(handle)->instance))

/**
  * @}
  */
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup I2S_Private_Functions I2S Private Functions
  * @{
  */
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
static void I2S_DMATxCplt(hal_dma_handle_t *hdma);
static void I2S_DMATxHalfCplt(hal_dma_handle_t *hdma);
static void I2S_DMARxCplt(hal_dma_handle_t *hdma);
static void I2S_DMARxHalfCplt(hal_dma_handle_t *hdma);
static void I2S_DMATxRxCplt(hal_dma_handle_t *hdma);
static void I2S_DMATxRxHalfCplt(hal_dma_handle_t *hdma);
static void I2S_DMAError(hal_dma_handle_t *hdma);
static void I2S_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void I2S_DMARxAbortCallback(hal_dma_handle_t *hdma);
static void I2S_DMATxRxAbortCallback(hal_dma_handle_t *hdma);
#endif /* USE_HAL_I2S_DMA */
static void I2S_Transmit_16Bit_IT(hal_i2s_handle_t *hi2s);
static void I2S_Transmit_32Bit_IT(hal_i2s_handle_t *hi2s);
static void I2S_Receive_16Bit_IT(hal_i2s_handle_t *hi2s);
static void I2S_Receive_32Bit_IT(hal_i2s_handle_t *hi2s);
static void I2S_AbortTransfer(const hal_i2s_handle_t *hi2s);
static hal_status_t  I2S_CloseTransfer(hal_i2s_handle_t *hi2s);
static hal_status_t  I2S_SetAudioFrequency(const hal_i2s_handle_t *hi2s, uint32_t i2s_clk,
                                           hal_i2s_master_audio_frequency_t audio_frequency_ws_hz);
static hal_i2s_master_audio_frequency_t I2S_GetAudioFrequency(const hal_i2s_handle_t *hi2s, uint32_t i2s_clk);
static void I2S_WaitTxFifoEmpty(hal_i2s_handle_t *hi2s);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @addtogroup I2S_Exported_Functions HAL I2S Functions
  * @{
  */

/** @addtogroup I2S_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{

  This subsection provides functions to initialize and deinitialize the I2Sx peripheral:
    - Call the function HAL_I2S_Init() to initialize the selected I2S handle and associate an instance.
    - Call the function HAL_I2S_DeInit() to restore the default initialization of the selected I2Sx peripheral.
  */

/**
  * @brief  Initialize the I2S according to the associated handle.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  instance I2S instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_ERROR When the MUTEX cannot be created.
  * @retval HAL_OK HAL I2S driver correctly initialized for the given I2S instance.
  */
hal_status_t HAL_I2S_Init(hal_i2s_handle_t *hi2s, hal_i2s_t instance)
{
  /* Check parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_ALL_INSTANCE((SPI_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the handle struct pointer */
  if (hi2s == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->instance = instance;

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  /* Init the I2S callback settings */
  hi2s->p_error_cb           = HAL_I2S_ErrorCallback;
  hi2s->p_tx_cplt_cb         = HAL_I2S_TxCpltCallback;
  hi2s->p_tx_half_cplt_cb    = HAL_I2S_TxHalfCpltCallback;
  hi2s->p_rx_cplt_cb         = HAL_I2S_RxCpltCallback;
  hi2s->p_rx_half_cplt_cb    = HAL_I2S_RxHalfCpltCallback;
  hi2s->p_tx_rx_cplt_cb      = HAL_I2S_TxRxCpltCallback;
  hi2s->p_tx_rx_half_cplt_cb = HAL_I2S_TxRxHalfCpltCallback;
  hi2s->p_abort_cplt_cb      = HAL_I2S_AbortCpltCallback;
#endif  /* USE_HAL_I2S_REGISTER_CALLBACKS */

  /* Other internal fields */
  hi2s->pause_state    = HAL_I2S_STATE_IDLE;
  hi2s->p_tx_buff      = (uint16_t *) NULL;
  hi2s->tx_xfer_size   = (uint16_t) 0U;
  hi2s->tx_xfer_count  = (uint16_t) 0U;
  hi2s->p_rx_buff      = (uint16_t *) NULL;
  hi2s->rx_xfer_size   = (uint16_t) 0U;
  hi2s->rx_xfer_count  = (uint16_t) 0U;

#if defined (USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  hi2s->hdma_tx        = (hal_dma_handle_t *) NULL;
  hi2s->hdma_rx        = (hal_dma_handle_t *) NULL;
#endif /* USE_HAL_I2S_DMA  */

