MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
#if defined(USE_HAL_I2S_USER_DATA) && (USE_HAL_I2S_USER_DATA == 1)
  /* Initialize the user data pointer to NULL */
  hi2s->p_user_data    = NULL;
#endif /* USE_HAL_I2S_USER_DATA */

#if defined (USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

#if defined(USE_HAL_I2S_CLK_ENABLE_MODEL) && (USE_HAL_I2S_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  switch (hi2s->instance)
  {
    case HAL_I2S1:
      HAL_RCC_SPI1_EnableClock();
      break;
    case HAL_I2S2:
      HAL_RCC_SPI2_EnableClock();
      break;
#if defined(SPI3)
    case HAL_I2S3:
      HAL_RCC_SPI3_EnableClock();
      break;
#endif /* SPI3 */
    default:
      break;
  }
#endif /* USE_HAL_I2S_CLK_ENABLE_MODEL */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&hi2s->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  hi2s->global_state = HAL_I2S_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the I2S driver for the given handle.
  * @param  hi2s pointer to a @ref hal_i2s_handle_t.
  */
void HAL_I2S_DeInit(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;
  hal_i2s_state_t temp_state;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_ALL_INSTANCE(p_i2sx));

  temp_state = hi2s->global_state;

  /* Check if any transfer is ongoing */
  if ((temp_state == HAL_I2S_STATE_TX_ACTIVE) || (temp_state == HAL_I2S_STATE_RX_ACTIVE)
      || (temp_state == HAL_I2S_STATE_TX_RX_ACTIVE))
  {
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
    if (LL_I2S_IsEnabledDMAReq_TX(p_i2sx) != 0U)
    {
      if (hi2s->hdma_tx != NULL)
      {
        (void)HAL_DMA_Abort(hi2s->hdma_tx);
      }
    }

    if (LL_I2S_IsEnabledDMAReq_RX(p_i2sx) != 0U)
    {
      if (hi2s->hdma_rx != NULL)
      {
        (void)HAL_DMA_Abort(hi2s->hdma_rx);
      }
    }
#endif /* USE_HAL_I2S_DMA */

    (void)I2S_AbortTransfer(hi2s);
  }

  /* Disable I2S peripheral */
  LL_I2S_DisableI2SMode(p_i2sx);
  LL_I2S_Disable(p_i2sx);

#if defined (USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  /* Reset the last_error_codes variable storing the last errors */
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&hi2s->semaphore);
#endif /* USE_HAL_MUTEX */

  hi2s->global_state = HAL_I2S_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup I2S_Exported_Functions_Group2 Configuration functions
  * @{
  This subsection provides functions to configure the I2Sx peripheral:
    - Call the function HAL_I2S_MASTER_SetConfig() to configure the selected device in master mode with the selected
      configuration:
      - Mode
      - Standard
      - Data format
      - Audio frequency selected
      - Clock polarity
      - Bit order
    - Call the function HAL_I2S_MASTER_GetConfig() to retrieve the current global configuration set by the application
      in master mode.
    - Call the function HAL_I2S_SLAVE_SetConfig() to configure the selected device in slave mode with the selected
      configuration:
      - Mode
      - Standard
      - Data format
      - Clock polarity
      - Bit order
    - Call the function HAL_I2S_SLAVE_GetConfig() to retrieve the current global configuration set by the application
      in slave mode.
  */

/**
  * @brief  Set the configuration to the I2S peripheral in Master mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_config Pointer to @ref hal_i2s_master_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  * @retval HAL_ERROR When IO locked.
  * @retval HAL_OK I2S instance has been correctly configured.
  */
hal_status_t HAL_I2S_MASTER_SetConfig(hal_i2s_handle_t *hi2s, const hal_i2s_master_config_t *p_config)
{
  SPI_TypeDef *p_i2sx;

  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER(p_config->mode));
  ASSERT_DBG_PARAM(IS_I2S_STANDARD(p_config->standard));
  ASSERT_DBG_PARAM(IS_I2S_DATA_FORMAT(p_config->data_format));
  ASSERT_DBG_PARAM(IS_I2S_MASTER_AUDIO_FREQUENCY(p_config->audio_frequency));
  ASSERT_DBG_PARAM(IS_I2S_CLOCK_POLARITY(p_config->clock_polarity));
  ASSERT_DBG_PARAM(IS_I2S_BIT_ORDER(p_config->bit_order));

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE | HAL_I2S_STATE_INIT);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the config struct pointer */
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  if (LL_I2S_IsEnabled(p_i2sx) != 0U)
  {
    LL_I2S_ClearFlag(p_i2sx, LL_I2S_FLAG_SUSP);
    LL_I2S_Disable(p_i2sx);
  }

  /* Set I2S generic configuration */
  LL_I2S_ConfigBus(p_i2sx, ((uint32_t)(p_config->mode) | (uint32_t)(p_config->standard)
                            | (uint32_t)(p_config->data_format) | (uint32_t)(p_config->clock_polarity)),
                   (uint32_t)(p_config->bit_order));

  if (I2S_SetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx), p_config->audio_frequency) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_I2S_EnableI2SMode(p_i2sx);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the configuration to the I2S peripheral in Slave mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_config Pointer to @ref hal_i2s_slave_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  * @retval HAL_ERROR When IO locked.
  * @retval HAL_OK I2S instance has been correctly configured.
  */
hal_status_t HAL_I2S_SLAVE_SetConfig(hal_i2s_handle_t *hi2s, const hal_i2s_slave_config_t *p_config)
{
  SPI_TypeDef *p_i2sx;

