MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_I2S_MODE_SLAVE(p_config->mode));
  ASSERT_DBG_PARAM(IS_I2S_STANDARD(p_config->standard));
  ASSERT_DBG_PARAM(IS_I2S_DATA_FORMAT(p_config->data_format));
  ASSERT_DBG_PARAM(IS_I2S_CLOCK_POLARITY(p_config->clock_polarity));
  ASSERT_DBG_PARAM(IS_I2S_BIT_ORDER(p_config->bit_order));

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE | HAL_I2S_STATE_INIT);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the config struct pointer */
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  if (LL_I2S_IsEnabled(p_i2sx) != 0U)
  {
    LL_I2S_ClearFlag(p_i2sx, LL_I2S_FLAG_SUSP);
    LL_I2S_Disable(p_i2sx);
  }

  /* Set I2S generic configuration */
  LL_I2S_ConfigBus(p_i2sx, ((uint32_t)(p_config->mode) | (uint32_t)(p_config->standard)
                            | (uint32_t)(p_config->data_format) | (uint32_t)(p_config->clock_polarity)),
                   (uint32_t)(p_config->bit_order));

  LL_I2S_EnableI2SMode(p_i2sx);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Retrieve the configuration of the I2S peripheral in Master mode.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param p_config Pointer to @ref hal_i2s_master_config_t configuration structure.
  */
void HAL_I2S_MASTER_GetConfig(const hal_i2s_handle_t *hi2s, hal_i2s_master_config_t *p_config)
{
  SPI_TypeDef *p_i2sx;
  uint32_t i2scfgr_reg_value;

  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  i2scfgr_reg_value = (uint32_t)(LL_I2S_READ_REG((p_i2sx), I2SCFGR));

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_I2SCFG))));
#endif /* USE_ASSERT_DBG_PARAM */

  p_config->mode = (hal_i2s_mode_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_I2SCFG));
  p_config->standard = (hal_i2s_standard_t)((uint32_t)(i2scfgr_reg_value & (SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC)));
  p_config->data_format = (hal_i2s_data_format_t)((uint32_t)(i2scfgr_reg_value
                                                             & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN)));
  p_config->clock_polarity = (hal_i2s_clock_polarity_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_CKPOL));
  p_config->bit_order = (hal_i2s_bit_order_t)(LL_I2S_GetTransferBitOrder(p_i2sx));
  p_config->audio_frequency = I2S_GetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx));
}

/**
  * @brief Retrieve the configuration of the I2S peripheral in Slave mode.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param p_config Pointer to @ref hal_i2s_slave_config_t configuration structure.
  */
void HAL_I2S_SLAVE_GetConfig(const hal_i2s_handle_t *hi2s, hal_i2s_slave_config_t *p_config)
{
  SPI_TypeDef *p_i2sx;
  uint32_t i2scfgr_reg_value;

  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  i2scfgr_reg_value = (uint32_t)(LL_I2S_READ_REG((p_i2sx), I2SCFGR));

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_I2S_MODE_SLAVE((hal_i2s_mode_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_I2SCFG))));
#endif /* USE_ASSERT_DBG_PARAM */

  p_config->mode = (hal_i2s_mode_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_I2SCFG));
  p_config->standard = (hal_i2s_standard_t)((uint32_t)(i2scfgr_reg_value & (SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC)));
  p_config->data_format = (hal_i2s_data_format_t)((uint32_t)(i2scfgr_reg_value
                                                             & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN)));
  p_config->clock_polarity = (hal_i2s_clock_polarity_t)((uint32_t)(i2scfgr_reg_value & SPI_I2SCFGR_CKPOL));
  p_config->bit_order = (hal_i2s_bit_order_t)(LL_I2S_GetTransferBitOrder(p_i2sx));
}

/**
  * @}
  */

/** @addtogroup I2S_Exported_Functions_Group3 Features functions
  * @{
  This subsection provides functions to configure additional
  features for the selected I2Sx peripheral.

- Master Clock Output configuration:
  - HAL_I2S_MASTER_EnableClockOutput()
  - HAL_I2S_MASTER_DisableClockOutput()
  - HAL_I2S_MASTER_IsEnabledClockOutput()

- Word Select Inversion configuration:
  - HAL_I2S_EnableWSInversion()
  - HAL_I2S_DisableWSInversion()
  - HAL_I2S_IsEnabledWSInversion()

- Master Keep IO State configuration:
  - HAL_I2S_MASTER_EnableKeepIOState()
  - HAL_I2S_MASTER_DisableKeepIOState()
  - HAL_I2S_MASTER_IsEnabledKeepIOState()

- IO Swap configuration:
  - HAL_I2S_EnableIOSwap()
  - HAL_I2S_DisableIOSwap()
  - HAL_I2S_IsEnabledIOSwap()

- Channel Length Detection Error configuration:
  - HAL_I2S_SLAVE_EnableLengthDetectionError()
  - HAL_I2S_SLAVE_DisableLengthDetectionError()
  - HAL_I2S_SLAVE_IsEnabledLengthDetectionError()

