MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
- IO lock configuration:
  - HAL_I2S_LockIOConfig()
  - HAL_I2S_IsLockedIOConfig()

- FIFO Threshold configuration:
  - HAL_I2S_SetFifoThreshold()
  - HAL_I2S_GetFifoThreshold()

- Data alignment for 24-bit data format configuration:
  - HAL_I2S_SetData24BitsAlignedRight()
  - HAL_I2S_SetData24BitsAlignedLeft()
  */

/**
  * @brief  Enable I2S Master Clock Output.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_MASTER_EnableClockOutput(hal_i2s_handle_t *hi2s)
{
  hal_i2s_master_audio_frequency_t audio_freq;
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  audio_freq = I2S_GetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx));

  LL_I2S_EnableMasterClock(p_i2sx);

  /* Update the  Word Select audio frequency with master clock output enabled */
  return I2S_SetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx), audio_freq);
}

/**
  * @brief  Disable I2S Master Clock Output.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_MASTER_DisableClockOutput(hal_i2s_handle_t *hi2s)
{
  hal_i2s_master_audio_frequency_t audio_freq;
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  audio_freq = I2S_GetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx));

  LL_I2S_DisableMasterClock(p_i2sx);

  /* Update the Word Select audio frequency with master clock output disabled */
  return I2S_SetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx), audio_freq);
}

/**
  * @brief  Get I2S Master Clock Output status.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Master clock output status.
  */
hal_i2s_master_clk_output_status_t HAL_I2S_MASTER_IsEnabledClockOutput(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_master_clk_output_status_t)LL_I2S_IsEnabledMasterClock(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Enable I2S Word Select Inversion.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_EnableWSInversion(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_EnableWordSelectInversion(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Disable I2S Word Select Inversion.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_DisableWSInversion(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_DisableWordSelectInversion(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Check I2S Word Select Inversion status.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Word select inversion status.
  */
hal_i2s_ws_inversion_status_t HAL_I2S_IsEnabledWSInversion(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_ws_inversion_status_t)LL_I2S_IsEnabledWordSelectInversion(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Enable Master Keep IO State feature. The peripheral always keeps control
  *         of all associated GPIOs to prevent any glitches on the line.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR When IO is locked.
  */
hal_status_t HAL_I2S_MASTER_EnableKeepIOState(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)(LL_I2S_GetTransferMode(p_i2sx))));
#endif /* USE_ASSERT_DBG_PARAM */

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  LL_I2S_Disable(p_i2sx);

  LL_I2S_EnableGPIOControl(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Disable Master Keep IO State feature.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR When IO is locked.
  */
hal_status_t HAL_I2S_MASTER_DisableKeepIOState(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)(LL_I2S_GetTransferMode(p_i2sx))));
#endif /* USE_ASSERT_DBG_PARAM */

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  LL_I2S_Disable(p_i2sx);

  /* Disable the Master Keep IO State */
  LL_I2S_DisableGPIOControl(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Check I2S Master Keep IO State feature status.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Master keep IO state status.
  */
hal_i2s_master_keep_io_state_status_t HAL_I2S_MASTER_IsEnabledKeepIOState(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_master_keep_io_state_status_t)LL_I2S_IsEnabledGPIOControl(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Enable IO Swap.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR When IO is locked.
  */
hal_status_t HAL_I2S_EnableIOSwap(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  LL_I2S_Disable(p_i2sx);

  /* Enable the IO Swap */
  LL_I2S_EnableIOSwap(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Disable IO Swap.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR When IO is locked.
  */
hal_status_t HAL_I2S_DisableIOSwap(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  LL_I2S_Disable(p_i2sx);

  /* Disable the IO Swap */
  LL_I2S_DisableIOSwap(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Check I2S IO swap status.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return IO swap status.
  */
hal_i2s_io_swap_status_t HAL_I2S_IsEnabledIOSwap(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_io_swap_status_t)LL_I2S_IsEnabledIOSwap(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Enable Channel Length detection error only in slave mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SLAVE_EnableLengthDetectionError(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_SLAVE((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

  LL_I2S_Disable(p_i2sx);

  /* Enable the channel length detection error */
  LL_I2S_SLAVE_EnableLengthDetectionError(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Disable Channel Length detection error only in slave mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SLAVE_DisableLengthDetectionError(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_SLAVE((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

  LL_I2S_Disable(p_i2sx);

  /* Disable the channel length detection error */
  LL_I2S_SLAVE_DisableLengthDetectionError(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Check I2S Channel Length detection error status only in slave mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Slave channel detection error status.
  */
hal_i2s_slave_length_detection_error_status_t HAL_I2S_SLAVE_IsEnabledLengthDetectionError(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_slave_length_detection_error_status_t)
         LL_I2S_SLAVE_IsEnabledLengthDetectionError(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Lock the IO configuration.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @note   The reset of the IOLock bit is done by hardware.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_LockIOConfig(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

