MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the I2S channel state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_EnableIOLock(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Retrieve the IO configuration status.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval hal_i2s_io_cfg_status_t.
  */
hal_i2s_io_cfg_status_t HAL_I2S_IsLockedIOConfig(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the I2S state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_io_cfg_status_t)LL_I2S_IsEnabledIOLock(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the FIFO threshold level.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  fifo_threshold This parameter must be a value of @ref hal_i2s_fifo_threshold_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetFifoThreshold(const hal_i2s_handle_t *hi2s, const hal_i2s_fifo_threshold_t fifo_threshold)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_FIFO_THRESHOLD(fifo_threshold));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetFIFOThreshold(p_i2sx, (uint32_t)fifo_threshold);

  return HAL_OK;
}

/**
  * @brief  Retrieve the bit order for data transfers (MSB or LSB bit first).
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S FIFO threshold level configuration.
  */
hal_i2s_fifo_threshold_t HAL_I2S_GetFifoThreshold(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_fifo_threshold_t)LL_I2S_GetFIFOThreshold(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the data alignment to right.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetData24BitsAlignedRight(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(LL_I2S_GetDataFormat(p_i2sx) == LL_I2S_DATA_FORMAT_24_BIT);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetDataAlignmentRight(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Set the data alignment to left.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetData24BitsAlignedLeft(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(LL_I2S_GetDataFormat(p_i2sx) == LL_I2S_DATA_FORMAT_24_BIT);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetDataAlignmentLeft(p_i2sx);

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup I2S_Exported_Functions_Group4 Items functions
  * @{
  This subsection provides functions to change and retrieve a single configuration in the
  IDLE state.
  - HAL_I2S_SetMode(): Set the mode of the I2S peripheral.
  - HAL_I2S_GetMode(): Retrieve the mode of the I2S peripheral.
  - HAL_I2S_SetStandard(): Set the standard of the I2S peripheral.
  - HAL_I2S_GetStandard(): Retrieve the standard of the I2S peripheral.
  - HAL_I2S_SetDataFormat(): Set the data format of the I2S peripheral.
  - HAL_I2S_GetDataFormat(): Retrieve the data format of the I2S peripheral.
  - HAL_I2S_MASTER_SetAudioFrequency(): Set the master Word Select audio frequency of the I2S peripheral.
  - HAL_I2S_MASTER_GetAudioFrequency(): Retrieve the master Word Select audio frequency of the I2S peripheral.
  - HAL_I2S_SetClockPolarity(): Set the clock polarity of the I2S peripheral.
  - HAL_I2S_GetClockPolarity(): Retrieve the clock polarity of the I2S peripheral.
  - HAL_I2S_SetBitOrder(): Set the bit order for data transfers (MSB or LSB bit first) of the I2S peripheral.
  - HAL_I2S_GetBitOrder(): Retrieve the bit order for data transfers (MSB or LSB bit first) of the I2S peripheral.
  - HAL_I2S_SetTxDMA(): Link the transmit DMA handle to the I2S handle.
  - HAL_I2S_SetRxDMA(): Link the receive DMA handle to the I2S handle.
  */

/**
  * @brief  Set the transfer mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  mode This parameter must be a value of @ref hal_i2s_mode_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetMode(const hal_i2s_handle_t *hi2s, const hal_i2s_mode_t mode)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_MODE(mode));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetTransferMode(p_i2sx, (uint32_t)mode);

  return HAL_OK;
}

/**
  * @brief  Retrieve the transfer mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S mode configuration.
  */
hal_i2s_mode_t HAL_I2S_GetMode(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

