MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  return (hal_i2s_mode_t)LL_I2S_GetTransferMode(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the standard.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  standard This parameter must be a value of @ref hal_i2s_standard_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetStandard(const hal_i2s_handle_t *hi2s, const hal_i2s_standard_t standard)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_STANDARD(standard));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetStandard(p_i2sx, (uint32_t)standard);

  return HAL_OK;
}

/**
  * @brief  Retrieve the standard.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S standard configuration.
  */
hal_i2s_standard_t HAL_I2S_GetStandard(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_standard_t)LL_I2S_GetStandard(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the data format.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  format This parameter must be a value of @ref hal_i2s_data_format_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetDataFormat(const hal_i2s_handle_t *hi2s, const hal_i2s_data_format_t format)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_DATA_FORMAT(format));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetDataFormat(p_i2sx, (uint32_t)format);

  return HAL_OK;
}

/**
  * @brief  Retrieve the data format.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S data format configuration.
  */
hal_i2s_data_format_t HAL_I2S_GetDataFormat(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_data_format_t)LL_I2S_GetDataFormat(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the master Word Select audio frequency.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  frequency_ws_hz This parameter must be a value of @ref hal_i2s_master_audio_frequency_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_MASTER_SetAudioFrequency(hal_i2s_handle_t *hi2s,
                                              const hal_i2s_master_audio_frequency_t frequency_ws_hz)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_MASTER_AUDIO_FREQUENCY(frequency_ws_hz));

  p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)(LL_I2S_GetTransferMode(p_i2sx))));
#endif /* USE_ASSERT_DBG_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

  LL_I2S_Disable(p_i2sx);

  return I2S_SetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx), frequency_ws_hz);
}

/**
  * @brief  Retrieve the master Word Select audio frequency.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S closest audio frequency configuration to the real audio frequency.
  */
hal_i2s_master_audio_frequency_t HAL_I2S_MASTER_GetAudioFrequency(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  return I2S_GetAudioFrequency(hi2s, HAL_RCC_SPI_GetKernelClkFreq(p_i2sx));
}

/**
  * @brief  Set the clock polarity.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  clock_polarity This parameter must be a value of @ref hal_i2s_clock_polarity_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetClockPolarity(const hal_i2s_handle_t *hi2s, const hal_i2s_clock_polarity_t clock_polarity)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_CLOCK_POLARITY(clock_polarity));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetClockPolarity(p_i2sx, (uint32_t)clock_polarity);

  return HAL_OK;
}

/**
  * @brief  Retrieve the clock polarity.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S clock polarity configuration.
  */
hal_i2s_clock_polarity_t HAL_I2S_GetClockPolarity(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  return (hal_i2s_clock_polarity_t)LL_I2S_GetClockPolarity(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Set the bit order for data transfers (MSB or LSB bit first).
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  bit_order This parameter must be a value of @ref hal_i2s_bit_order_t.
  * @retval HAL_ERROR When IO is locked.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_I2S_SetBitOrder(hal_i2s_handle_t *hi2s, const hal_i2s_bit_order_t bit_order)
{
  SPI_TypeDef *p_i2sx;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(IS_I2S_BIT_ORDER(bit_order));

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  if (LL_I2S_IsEnabledIOLock(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_IO_LOCKED);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  LL_I2S_Disable(p_i2sx);

  LL_I2S_SetTransferBitOrder(p_i2sx, (uint32_t)bit_order);

  return HAL_OK;
}

/**
  * @brief  Retrieve the bit order for data transfers (MSB or LSB bit first).
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return Current I2S bit order configuration.
  */
hal_i2s_bit_order_t HAL_I2S_GetBitOrder(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

