MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  return (hal_i2s_bit_order_t)LL_I2S_GetTransferBitOrder(I2S_GET_INSTANCE(hi2s));
}

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
/**
  * @brief  Link the Transmit DMA handle to the I2S handle.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t structure.
  * @param  hdma Pointer to a hal_dma_handle_t structure.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_I2S_SetTxDMA(hal_i2s_handle_t *hi2s, hal_dma_handle_t *hdma)
{
  /* Check the I2S and DMA handle */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Link the DMA handle to the I2S handle */
  hi2s->hdma_tx = hdma;
  hdma->p_parent = hi2s;

  return HAL_OK;
}

/**
  * @brief  Link the Receive DMA handle to the I2S handle.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  hdma Pointer to a hal_dma_handle_t structure.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  */
hal_status_t HAL_I2S_SetRxDMA(hal_i2s_handle_t *hi2s, hal_dma_handle_t *hdma)
{
  /* Check the I2S and DMA handle */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Link the DMA handle to the I2S handle */
  hi2s->hdma_rx = hdma;
  hdma->p_parent = hi2s;

  return HAL_OK;
}
#endif /* USE_HAL_I2S_DMA */

/**
  * @}
  */

/** @addtogroup I2S_Exported_Functions_Group5 IO operation functions
  * @{
  * This subsection provides a set of functions allowing the management of the I2S data transfers.
  *
  * The I2S supports both master and slave mode:
  * There are two modes of transfer:
  *  - Blocking mode: The communication is performed in polling mode.
  *    The status of all data processing is returned by the same function after finishing the transfer.
  *  - No-Blocking mode: The communication is performed using Interrupts or DMA.
  *    These functions return the status of the transfer startup.
  *    The end of the data processing will be indicated through the dedicated I2S IRQ when using
  *    Interrupt mode or the DMA IRQ when using DMA mode.
  */

/**
  * @brief  Return the real master Word Select audio frequency.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval 0 I2S source clock frequency not active
  * @retval Other value, Real audio frequency in Hz.
  */
uint32_t HAL_I2S_MASTER_GetRealAudioFrequency(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;
  uint32_t frequency_ws_hz = 0U;
  uint32_t i2s_clk;
  uint32_t channel_length = 1U;
  uint32_t i2s_odd = 0U;
  uint32_t i2s_div = 0U;
  uint32_t ispcm = 0U;
  uint32_t prescaler = 1U;
  uint32_t i2scfgr_reg_value;
  uint32_t mckoe;
  hal_i2s_standard_t standard;
  hal_i2s_data_format_t data_format;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT));

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  i2scfgr_reg_value = (uint32_t)(LL_I2S_READ_REG((p_i2sx), I2SCFGR));

  i2s_clk = HAL_RCC_SPI_GetKernelClkFreq(p_i2sx);

  if (i2s_clk != 0U)
  {
    data_format = (hal_i2s_data_format_t)((uint32_t)(i2scfgr_reg_value & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN)));
    i2s_odd = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_ODD) >> SPI_I2SCFGR_ODD_Pos));
    i2s_div = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_I2SDIV) >> SPI_I2SCFGR_I2SDIV_Pos));
    standard = (hal_i2s_standard_t)((uint32_t)(i2scfgr_reg_value & (SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC)));
    mckoe = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_MCKOE) >> SPI_I2SCFGR_MCKOE_Pos));

    if (i2s_div != 0U)
    {
      prescaler = (uint32_t)((2U * i2s_div) + i2s_odd);
    }

    if (IS_I2S_STANDARD_PCM(standard))
    {
      ispcm = 1U;
    }

    if (IS_I2S_CHANNEL_LENGTH_32_BIT(data_format))
    {
      /* Channel length is 32 bits */
      channel_length = 2U;
    }

    /* Reference Manual, SPI/I2S section, Chapter Clock generator:
    Depending on the master clock state (MCKOE = 0 or MCKOE = 1), the frequency of the frame
    synchronization is given by the following formulas */
    if (mckoe != 0U)
    {
      frequency_ws_hz = (uint32_t)(i2s_clk / (((uint32_t)(256UL >> ispcm)) * prescaler));
    }
    else
    {
      frequency_ws_hz = (uint32_t)(i2s_clk / ((((uint32_t)(32UL >> ispcm)) * channel_length) * prescaler));
    }

    return frequency_ws_hz;
  }
  else
  {
    return 0U;
  }
}

/**
  * @brief  Transmit an amount of data in blocking mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_data Pointer to data buffer.
  * @param  size_sample Amount of data to send in bytes.
  * @param  timeout_ms Timeout duration.
  * @return hal_status_t.
  */
hal_status_t HAL_I2S_Transmit(hal_i2s_handle_t *hi2s, const void *p_data, uint32_t size_sample,
                              uint32_t timeout_ms)
{
  SPI_TypeDef *p_i2sx;
  uint32_t tickstart;
  hal_i2s_data_format_t data_format;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_sample != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_sample == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_TX((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

  HAL_CHECK_UPDATE_STATE(hi2s, global_state, HAL_I2S_STATE_IDLE, HAL_I2S_STATE_TX_ACTIVE);

