MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  HAL_CHECK_UPDATE_STATE(hi2s, global_state, HAL_I2S_STATE_IDLE, HAL_I2S_STATE_TX_RX_ACTIVE);

  /* Init tickstart for timeout management */
  tickstart = HAL_GetTick();

  data_format = (hal_i2s_data_format_t)LL_I2S_GetDataFormat(p_i2sx);

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  hi2s->p_tx_buff = (const uint16_t *)p_tx_data;
  hi2s->tx_xfer_size = (uint16_t)size_sample;
  hi2s->tx_xfer_count = (uint16_t)size_sample;
  hi2s->p_rx_buff = (uint16_t *)p_rx_data;
  hi2s->rx_xfer_size = (uint16_t)size_sample;
  hi2s->rx_xfer_count = (uint16_t)size_sample;
  initial_tx_xfer_count = (uint16_t)size_sample;
  initial_rx_xfer_count = (uint16_t)size_sample;

  LL_I2S_Enable(p_i2sx);
  LL_I2S_StartTransfer(p_i2sx);

  if ((data_format == HAL_I2S_DATA_FORMAT_24_BIT) || (data_format == HAL_I2S_DATA_FORMAT_32_BIT))
  {
    while ((initial_tx_xfer_count > 0U) || (initial_rx_xfer_count > 0U))
    {
      if ((LL_I2S_IsActiveFlag_TXP(p_i2sx) != 0U) && (initial_tx_xfer_count != 0U))
      {
        LL_I2S_TransmitData32(p_i2sx, *((const uint32_t *)hi2s->p_tx_buff));
        hi2s->p_tx_buff += 2U;
        hi2s->tx_xfer_count--;
        initial_tx_xfer_count = hi2s->tx_xfer_count;
      }

      if ((LL_I2S_IsActiveFlag_RXP(p_i2sx) != 0U) && (initial_rx_xfer_count != 0U))
      {
        *((uint32_t *)hi2s->p_rx_buff) = LL_I2S_ReceiveData32(p_i2sx);
        hi2s->p_rx_buff += 2U;
        hi2s->rx_xfer_count--;
        initial_rx_xfer_count = hi2s->rx_xfer_count;
      }

      /* Timeout management */
      if ((((HAL_GetTick() - tickstart) >= timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }
  else
  {
    while ((initial_tx_xfer_count > 0U) || (initial_rx_xfer_count > 0U))
    {
      if ((LL_I2S_IsActiveFlag_TXP(p_i2sx) != 0U) && (initial_tx_xfer_count != 0U))
      {
        LL_I2S_TransmitData16(p_i2sx, *((const uint16_t *)hi2s->p_tx_buff));
        hi2s->p_tx_buff++;
        hi2s->tx_xfer_count--;
        initial_tx_xfer_count = hi2s->tx_xfer_count;
      }

      if ((LL_I2S_IsActiveFlag_RXP(p_i2sx) != 0U) && (initial_rx_xfer_count != 0U))
      {
        *((uint16_t *)hi2s->p_rx_buff) = LL_I2S_ReceiveData16(p_i2sx);
        hi2s->p_rx_buff++;
        hi2s->rx_xfer_count--;
        initial_rx_xfer_count = hi2s->rx_xfer_count;
      }

      /* Timeout management */
      if ((((HAL_GetTick() - tickstart) >= timeout_ms) && (timeout_ms != HAL_MAX_DELAY)) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return I2S_CloseTransfer(hi2s);
}

/**
  * @brief  Transmit an amount of data in Interrupt mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_data Pointer to data buffer.
  * @param  size_sample Amount of data to send.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  */
hal_status_t HAL_I2S_Transmit_IT(hal_i2s_handle_t *hi2s, const void *p_data, uint32_t size_sample)
{
  SPI_TypeDef *p_i2sx;
  uint32_t it_mask = LL_I2S_IT_TXP;
  hal_i2s_data_format_t data_format;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_sample != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_sample == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_TX((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

  HAL_CHECK_UPDATE_STATE(hi2s, global_state, HAL_I2S_STATE_IDLE, HAL_I2S_STATE_TX_ACTIVE);

  data_format = (hal_i2s_data_format_t)LL_I2S_GetDataFormat(p_i2sx);

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  hi2s->p_tx_buff = (const uint16_t *)p_data;
  hi2s->tx_xfer_size = (uint16_t)size_sample;
  hi2s->tx_xfer_count = (uint16_t)size_sample;

  /* Initialize fields not used in handle to zero */
  hi2s->p_rx_buff = (uint16_t *)NULL;
  hi2s->rx_xfer_size = (uint16_t) 0U;
  hi2s->rx_xfer_count = (uint16_t) 0U;

  /* Set the function for IT treatment */
  if ((data_format == HAL_I2S_DATA_FORMAT_24_BIT) || (data_format == HAL_I2S_DATA_FORMAT_32_BIT))
  {
    hi2s->p_tx_isr = I2S_Transmit_32Bit_IT;
  }
  else
  {
    hi2s->p_tx_isr = I2S_Transmit_16Bit_IT;
  }

  /* Enable I2S peripheral */
  LL_I2S_Enable(p_i2sx);

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  it_mask |= LL_I2S_IT_UDR;
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  /* Enable TIFRE interrupt if the mode is Slave  */
  if ((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx) == HAL_I2S_MODE_SLAVE_TX)
  {
    it_mask |= LL_I2S_IT_TIFRE;
  }

  LL_I2S_EnableIT(p_i2sx, it_mask);

  /* Start the transfer */
  LL_I2S_StartTransfer(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Receive an amount of data in Interrupt mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_data Pointer to data buffer.
  * @param  size_sample Amount of data to receive.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  */
hal_status_t HAL_I2S_Receive_IT(hal_i2s_handle_t *hi2s, void *p_data, uint32_t size_sample)
{
  SPI_TypeDef *p_i2sx;
  uint32_t it_mask = LL_I2S_IT_RXP;
  hal_i2s_data_format_t data_format;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_sample != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_sample == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_RX((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));
#if defined(USE_ASSERT_DBG_PARAM)
  if (LL_I2S_GetFIFOThreshold(p_i2sx) != LL_I2S_FIFO_THRESHOLD_1_DATA)
  {
    ASSERT_DBG_PARAM(IS_I2S_TRANSFER_SIZE(((uint32_t)size_sample), ((uint32_t)LL_I2S_GetFIFOThreshold(p_i2sx))));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2s, global_state, HAL_I2S_STATE_IDLE, HAL_I2S_STATE_RX_ACTIVE);

