MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  data_format = (hal_i2s_data_format_t)LL_I2S_GetDataFormat(p_i2sx);

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  hi2s->p_tx_buff = (const uint16_t *)p_data;
  hi2s->tx_xfer_size = (uint16_t)size_sample;
  hi2s->tx_xfer_count = (uint16_t)size_sample;

  /* Initialize fields not used in handle to zero */
  hi2s->p_rx_buff = (uint16_t *)NULL;
  hi2s->rx_xfer_size = (uint16_t)0U;
  hi2s->rx_xfer_count = (uint16_t)0U;
  hi2s->p_rx_isr = NULL;
  hi2s->p_tx_isr = NULL;

  hi2s->hdma_tx->p_xfer_halfcplt_cb = I2S_DMATxHalfCplt;
  hi2s->hdma_tx->p_xfer_cplt_cb = I2S_DMATxCplt;
  hi2s->hdma_tx->p_xfer_error_cb = I2S_DMAError;

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hi2s->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    /* Get DMA channel circular transfer configuration */
    HAL_DMA_GetNodeConfig(hi2s->hdma_tx->p_head_node, &p_dma_tx_node_config, &p_node_type);
    p_dma_tx_config.src_data_width = p_dma_tx_node_config.xfer.src_data_width;
  }
  else
  {
    /* Get DMA channel direct transfer configuration */
    HAL_DMA_GetConfigDirectXfer(hi2s->hdma_tx, &p_dma_tx_config);
  }
#else
  HAL_DMA_GetConfigDirectXfer(hi2s->hdma_tx, &p_dma_tx_config);
#endif /* USE_HAL_DMA_LINKEDLIST */

  if (((data_format == HAL_I2S_DATA_FORMAT_16_BIT)
       && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_24_BIT)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_WORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_32_BIT)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_WORD)))
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) &&(USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    hi2s->global_state = HAL_I2S_STATE_IDLE;
    return HAL_ERROR;
  }

  if ((data_format == HAL_I2S_DATA_FORMAT_16_BIT) || (data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED))
  {
    hi2s->tx_xfer_count = (uint16_t)(size_sample * 2U);
  }
  else
  {
    hi2s->tx_xfer_count = (uint16_t)(size_sample * 4U);
  }

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hi2s->hdma_tx,
                                     (uint32_t)hi2s->p_tx_buff,
                                     (uint32_t) &((SPI_TypeDef *)((uint32_t)hi2s->instance))->TXDR,
                                     hi2s->tx_xfer_count, HAL_DMA_OPT_IT_DEFAULT) != HAL_OK)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) &&(USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    hi2s->global_state = HAL_I2S_STATE_IDLE;
    return HAL_ERROR;
  }

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  it_mask |= (LL_I2S_IT_UDR | LL_I2S_IT_OVR);
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  LL_I2S_EnableIT(p_i2sx, it_mask);

  /* Enable DMA request for the transmission */
  LL_I2S_EnableDMAReq_TX(p_i2sx);

  /* Enable I2S to start the transfer */
  LL_I2S_Enable(p_i2sx);
  LL_I2S_StartTransfer(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Receive an amount of data in DMA mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_data Pointer to data buffer.
  * @param  size_sample Amount of data to receive.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_BUSY Concurrent process ongoing.
  * @retval HAL_ERROR Operation completed with error.
  * @retval HAL_INVALID_PARAM Invalid parameters.
  */
hal_status_t HAL_I2S_Receive_DMA(hal_i2s_handle_t *hi2s, void *p_data, uint32_t size_sample)
{
  SPI_TypeDef *p_i2sx;
  uint32_t it_mask = LL_I2S_IT_TIFRE;
  hal_i2s_data_format_t data_format;
  hal_dma_direct_xfer_config_t p_dma_rx_config;
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hal_dma_node_config_t p_dma_rx_node_config;
  hal_dma_node_type_t  p_node_type = HAL_DMA_NODE_LINEAR_ADDRESSING;
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Check the I2S allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(hi2s->hdma_rx != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_sample != 0U);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_sample == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_IDLE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_RX((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));
#if defined(USE_ASSERT_DBG_PARAM)
  if (LL_I2S_GetFIFOThreshold(p_i2sx) != LL_I2S_FIFO_THRESHOLD_1_DATA)
  {
    ASSERT_DBG_PARAM(IS_I2S_TRANSFER_SIZE(((uint32_t)size_sample), ((uint32_t)LL_I2S_GetFIFOThreshold(p_i2sx))));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  HAL_CHECK_UPDATE_STATE(hi2s, global_state, HAL_I2S_STATE_IDLE, HAL_I2S_STATE_RX_ACTIVE);

  data_format = (hal_i2s_data_format_t)LL_I2S_GetDataFormat(p_i2sx);

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  hi2s->p_rx_buff = (uint16_t *)p_data;
  hi2s->rx_xfer_size = (uint16_t)size_sample;
  hi2s->rx_xfer_count = (uint16_t)size_sample;

  /* Initialize fields not used in handle to zero */
  hi2s->p_tx_buff = (uint16_t *)NULL;
  hi2s->tx_xfer_size = (uint16_t)0U;
  hi2s->tx_xfer_count = (uint16_t)0U;
  hi2s->p_rx_isr = NULL;
  hi2s->p_tx_isr = NULL;

  hi2s->hdma_rx->p_xfer_halfcplt_cb = I2S_DMARxHalfCplt;
  hi2s->hdma_rx->p_xfer_cplt_cb = I2S_DMARxCplt;
  hi2s->hdma_rx->p_xfer_error_cb = I2S_DMAError;

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hi2s->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    /* Get DMA channel circular transfer configuration */
    HAL_DMA_GetNodeConfig(hi2s->hdma_rx->p_head_node, &p_dma_rx_node_config, &p_node_type);
    p_dma_rx_config.dest_data_width = p_dma_rx_node_config.xfer.dest_data_width;
  }
  else
  {
    /* Get DMA channel direct transfer configuration */
    HAL_DMA_GetConfigDirectXfer(hi2s->hdma_rx, &p_dma_rx_config);
  }
#else
  HAL_DMA_GetConfigDirectXfer(hi2s->hdma_rx, &p_dma_rx_config);
#endif /* USE_HAL_DMA_LINKEDLIST */

