MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  if (((data_format == HAL_I2S_DATA_FORMAT_16_BIT)
       && (p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_16_BIT)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED)
          && (p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_HALFWORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_24_BIT)
          && (p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_WORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_24_BIT)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_WORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_32_BIT)
          && (p_dma_rx_config.dest_data_width != HAL_DMA_DEST_DATA_WIDTH_WORD))
      || ((data_format == HAL_I2S_DATA_FORMAT_32_BIT)
          && (p_dma_tx_config.src_data_width != HAL_DMA_SRC_DATA_WIDTH_WORD)))
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) &&(USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    hi2s->global_state = HAL_I2S_STATE_IDLE;
    return HAL_ERROR;
  }

  if ((data_format == HAL_I2S_DATA_FORMAT_16_BIT) || (data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED))
  {
    hi2s->tx_xfer_count = (uint16_t)(size_sample * 2U);
  }
  else
  {
    hi2s->tx_xfer_count = (uint16_t)(size_sample * 4U);
  }

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hi2s->hdma_tx,
                                     (uint32_t)hi2s->p_tx_buff,
                                     (uint32_t) &((SPI_TypeDef *)((uint32_t)hi2s->instance))->TXDR,
                                     hi2s->tx_xfer_count, HAL_DMA_OPT_IT_DEFAULT) != HAL_OK)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) &&(USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    hi2s->global_state = HAL_I2S_STATE_IDLE;
    return HAL_ERROR;
  }

  if ((data_format == HAL_I2S_DATA_FORMAT_16_BIT) || (data_format == HAL_I2S_DATA_FORMAT_16_BIT_EXTENDED))
  {
    hi2s->rx_xfer_count = (uint16_t)(size_sample * 2U);
  }
  else
  {
    hi2s->rx_xfer_count = (uint16_t)(size_sample * 4U);
  }

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hi2s->hdma_rx,
                                     (uint32_t) &((SPI_TypeDef *)((uint32_t)hi2s->instance))->RXDR,
                                     (uint32_t)hi2s->p_rx_buff,
                                     hi2s->rx_xfer_count, HAL_DMA_OPT_IT_DEFAULT) != HAL_OK)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) &&(USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    hi2s->global_state = HAL_I2S_STATE_IDLE;
    return HAL_ERROR;
  }

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  it_mask |= (LL_I2S_IT_UDR | LL_I2S_IT_OVR);
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  LL_I2S_EnableIT(p_i2sx, it_mask);

  /* Enable DMA requests */
  LL_I2S_EnableDMAReq_TX(p_i2sx);
  LL_I2S_EnableDMAReq_RX(p_i2sx);

  /* Enable I2S to start the transfer */
  LL_I2S_Enable(p_i2sx);
  LL_I2S_StartTransfer(p_i2sx);

  return HAL_OK;
}
#endif /* USE_HAL_I2S_DMA */

/**
  * @brief  Pause the process in master mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @note   During the process of pause and resume, some data will be missed.
  * @note   To prevent any glitches on data line, the function HAL_I2S_MASTER_EnableKeepIOState
  *         must be used.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR No process ongoing.
  */
hal_status_t HAL_I2S_MASTER_Pause(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;
  hal_status_t status = HAL_OK;
  volatile uint32_t count;
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  uint32_t dma_rx_req = 0U;
  uint32_t dma_tx_req = 0U;
#endif /* USE_HAL_I2S_DMA */
  uint32_t it_mask = (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE);

  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_TX_ACTIVE | HAL_I2S_STATE_RX_ACTIVE | HAL_I2S_STATE_TX_RX_ACTIVE);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  dma_rx_req = LL_I2S_IsEnabledDMAReq_RX(p_i2sx);
  dma_tx_req = LL_I2S_IsEnabledDMAReq_TX(p_i2sx);
#endif /* USE_HAL_I2S_DMA */

  /* Compute software timeout based on system core clock */
  count = I2S_DEFAULT_TIMEOUT_MS * (SystemCoreClock / 24U / 1000U);

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  it_mask |= (LL_I2S_IT_OVR | LL_I2S_IT_UDR);
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  if ((dma_rx_req == 0U) && (dma_tx_req == 0U))
  {
    LL_I2S_DisableIT(p_i2sx, it_mask);
  }
#else
  LL_I2S_DisableIT(p_i2sx, it_mask);
#endif /* USE_HAL_I2S_DMA */

  hi2s->pause_state = hi2s->global_state;
  hi2s->global_state = HAL_I2S_STATE_PAUSED;

  /* Suspend current transfer */
  LL_I2S_SuspendTransfer(p_i2sx);

  /* Wait for the transfer to stop */
  do
  {
    count--;
    if (count == 0U)
    {
      hi2s->global_state = HAL_I2S_STATE_IDLE;
      status = HAL_TIMEOUT;
      break;
    }
  } while (LL_I2S_IsActiveTransfer(p_i2sx) != 0U);

  return status;
}

/**
  * @brief  Resume the process in master mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @note   During the process of pause and resume, some data will be missed.
  * @note   To prevent any glitches on data line, the function HAL_I2S_MASTER_EnableKeepIOState
  *         must be used.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR No process paused.
  */
hal_status_t HAL_I2S_MASTER_Resume(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  uint32_t dma_rx_req = 0U;
  uint32_t dma_tx_req = 0U;
#endif /* USE_HAL_I2S_DMA */
  uint32_t it_mask = LL_I2S_IT_TIFRE;

  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_PAUSED);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

