MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  ASSERT_DBG_PARAM(IS_I2S_MODE_MASTER((hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx)));

  hi2s->global_state = hi2s->pause_state;
  hi2s->pause_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  dma_rx_req = LL_I2S_IsEnabledDMAReq_RX(p_i2sx);
  dma_tx_req = LL_I2S_IsEnabledDMAReq_TX(p_i2sx);
#endif /* USE_HAL_I2S_DMA */

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  it_mask |= (LL_I2S_IT_OVR |  LL_I2S_IT_UDR);
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  if ((dma_rx_req == 0U) && (dma_tx_req == 0U))
#endif /* USE_HAL_I2S_DMA */
  {
    if (hi2s->global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      it_mask |= (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP);
    }
    else if (hi2s->global_state == HAL_I2S_STATE_TX_ACTIVE)
    {
      it_mask |= LL_I2S_IT_TXP;
    }
    else
    {
      it_mask |= LL_I2S_IT_RXP;
    }

    LL_I2S_EnableIT(p_i2sx, it_mask);
  }

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  /* Reset error code to prevent any lingering error caused by the pause resume process */
  hi2s->last_error_codes = HAL_I2S_ERROR_NONE;
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  /* Resume transfer */
  LL_I2S_StartTransfer(p_i2sx);

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfer in blocking mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_I2S_Abort(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx;
  hal_status_t status = HAL_OK;
  volatile uint32_t count;
  hal_i2s_mode_t mode;

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_TX_ACTIVE | HAL_I2S_STATE_RX_ACTIVE
                   | HAL_I2S_STATE_TX_RX_ACTIVE | HAL_I2S_STATE_PAUSED);

  p_i2sx = I2S_GET_INSTANCE(hi2s);

  /* Disable ITs */
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_OVR
                            | LL_I2S_IT_UDR | LL_I2S_IT_TIFRE));
#else
  LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  /* Set I2S global state to abort to avoid any interaction */
  hi2s->global_state = HAL_I2S_STATE_ABORT;

  /* Compute software timeout based on system core clock */
  count = I2S_DEFAULT_TIMEOUT_MS * (SystemCoreClock / 24U / 1000U);
  mode = (hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx);

  if (IS_I2S_MODE_MASTER(mode))
  {
    /* Suspend current transfer */
    LL_I2S_SuspendTransfer(p_i2sx);

    /* Wait for transfer to stop */
    do
    {
      count--;
      if (count == 0U)
      {
        hi2s->global_state = HAL_I2S_STATE_IDLE;
        status = HAL_TIMEOUT;
        break;
      }
    } while (LL_I2S_IsActiveTransfer(p_i2sx) != 0U);
  }

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  if (LL_I2S_IsEnabledDMAReq_TX(p_i2sx) != 0U)
  {
    if (hi2s->hdma_tx != NULL)
    {
      if (HAL_DMA_Abort(hi2s->hdma_tx) != HAL_OK)
      {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
        STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
  }

  if (LL_I2S_IsEnabledDMAReq_RX(p_i2sx) != 0U)
  {
    if (hi2s->hdma_rx != NULL)
    {
      if (HAL_DMA_Abort(hi2s->hdma_rx) != HAL_OK)
      {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
        STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
        status = HAL_ERROR;
      }
    }
  }
#endif /* USE_HAL_I2S_DMA */

  I2S_AbortTransfer(hi2s);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

  return status;
}

/**
  * @brief  Abort ongoing transfer in no-blocking mode.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_I2S_Abort_IT(hal_i2s_handle_t *hi2s)
{
  hal_status_t status = HAL_OK;
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  SPI_TypeDef *p_i2sx;
  volatile uint32_t count;
  uint32_t dma_rx_req = 0U;
  uint32_t dma_tx_req = 0U;
  hal_i2s_mode_t mode;
#endif /* USE_HAL_I2S_DMA */

  /* Check the I2S handle allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_TX_ACTIVE | HAL_I2S_STATE_RX_ACTIVE
                   | HAL_I2S_STATE_TX_RX_ACTIVE | HAL_I2S_STATE_PAUSED);

  /* Set I2S global state to abort to avoid any interaction */
  hi2s->global_state = HAL_I2S_STATE_ABORT;

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  p_i2sx = I2S_GET_INSTANCE(hi2s);

  dma_rx_req = LL_I2S_IsEnabledDMAReq_RX(p_i2sx);
  dma_tx_req = LL_I2S_IsEnabledDMAReq_TX(p_i2sx);

  if ((dma_rx_req == 0U) && (dma_tx_req == 0U))
  {
    return HAL_OK;
  }
  else
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_OVR
                              | LL_I2S_IT_UDR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    /* Compute software timeout based on system core clock */
    count = I2S_DEFAULT_TIMEOUT_MS * (SystemCoreClock / 24U / 1000U);

    mode = (hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx);

    /* Only in DMA */
    if (IS_I2S_MODE_MASTER(mode))
    {
      /* Suspend current transfer */
      LL_I2S_SuspendTransfer(p_i2sx);

      /* Wait for communication to stop */
      do
      {
        count--;
        if (count == 0UL)
        {
          hi2s->global_state = HAL_I2S_STATE_IDLE;
          status = HAL_TIMEOUT;
          break;
        }
      } while (LL_I2S_IsActiveTransfer(p_i2sx) != 0U);
    }

    if ((hi2s->hdma_tx != NULL) && (hi2s->hdma_rx != NULL))
    {
      if ((dma_rx_req != 0U) && (dma_tx_req != 0U))
      {
        hi2s->hdma_tx->p_xfer_abort_cb = I2S_DMATxRxAbortCallback;

        if (HAL_DMA_Abort_IT(hi2s->hdma_tx) != HAL_OK)
        {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
          STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
          status = HAL_ERROR;
        }
      }
      else if ((dma_rx_req != 0U) && (dma_tx_req == 0U))
      {
        hi2s->hdma_rx->p_xfer_abort_cb = I2S_DMARxAbortCallback;

        if (HAL_DMA_Abort_IT(hi2s->hdma_rx) != HAL_OK)
        {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
          STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
          status = HAL_ERROR;
        }
      }
      else if ((dma_tx_req != 0U) && (dma_rx_req == 0U))
      {
        hi2s->hdma_tx->p_xfer_abort_cb = I2S_DMATxAbortCallback;

        if (HAL_DMA_Abort_IT(hi2s->hdma_tx) != HAL_OK)
        {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
          STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
          status = HAL_ERROR;
        }
      }
      else
      {
        /* No DMA request */
      }
    }
    else if ((hi2s->hdma_rx != NULL) && (hi2s->hdma_tx == NULL))
    {
      if (dma_rx_req != 0U)
      {
        hi2s->hdma_rx->p_xfer_abort_cb = I2S_DMARxAbortCallback;

        if (HAL_DMA_Abort_IT(hi2s->hdma_rx) != HAL_OK)
        {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
          STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
          status = HAL_ERROR;
        }
      }
    }
    else if ((hi2s->hdma_tx != NULL) && (hi2s->hdma_rx == NULL))
    {
      /* Transmit DMA */
      if (dma_tx_req != 0U)
      {
        hi2s->hdma_tx->p_xfer_abort_cb = I2S_DMATxAbortCallback;

        if (HAL_DMA_Abort_IT(hi2s->hdma_tx) != HAL_OK)
        {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
          STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
          status = HAL_ERROR;
        }
      }
    }
    else
    {
      /* No DMA handle available */
      status = HAL_INVALID_PARAM;
    }
  }

#endif /* USE_HAL_I2S_DMA */

