MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  return status;
}
/**
  * @}
  */

/** @defgroup I2S_Exported_Functions_Group6 IRQ handler/callbacks/register callbacks functions
  * @{
  * This subsection provides functions to process I2S interrupts and register I2S
  * process and error callbacks:
  *  - The function HAL_I2S_IRQHandler() to handle all I2S interrupts
  *
  * There are two ways to use callbacks:
  * Override weak callbacks functions:
  *  - Call the function HAL_I2S_ErrorCallback() to indicate invalid operation is completed
  *  - Call the function HAL_I2S_TxCpltCallback() to indicate Tx transfer is completed
  *  - Call the function HAL_I2S_TxHalfCpltCallback() to indicate Tx half transfer is completed
  *  - Call the function HAL_I2S_RxCpltCallback() to indicate Rx transfer is completed
  *  - Call the function HAL_I2S_RxHalfCpltCallback() to indicate Rx half transfer is completed
  *  - Call the function HAL_I2S_TxRxCpltCallback() to indicate Tx/Rx transfer is completed
  *  - Call the function HAL_I2S_TxRxHalfCpltCallback() to indicate Tx/Rx half transfer is completed
  *  - Call the function HAL_I2S_AbortCpltCallback() to indicate Abort operation is completed
  *
  * Register callbacks:
  *  - Call the function HAL_I2S_RegisterErrorCallback() to register the Error callback
  *  - Call the function HAL_I2S_RegisterTxCpltCallback() to register the Tx transfer complete callback
  *  - Call the function HAL_I2S_RegisterTxHalfCpltCallback() to register the Tx half transfer complete callback
  *  - Call the function HAL_I2S_RegisterRxCpltCallback() to register the Rx transfer complete callback
  *  - Call the function HAL_I2S_RegisterRxHalfCpltCallback() to register the Rx half transfer complete callback
  *  - Call the function HAL_I2S_RegisterTxRxCpltCallback() to register the Tx/Rx transfer complete callback
  *  - Call the function HAL_I2S_RegisterTxRxHalfCpltCallback() to register the Tx/Rx half transfer complete callback
  *  - Call the function HAL_I2S_RegisterAbortCpltCallback() to register the Abort operation complete callback

  Depending on the process function in use, different callbacks can be triggered:

| Process API \n \ \n Callbacks | HAL_I2S_Transmit_IT  | HAL_I2S_Receive_IT | HAL_I2S_TransmitReceive_IT |
|-------------------------------|:--------------------:|:------------------:|:--------------------------:|
| HAL_I2S_TxCpltCallback        |           x          |                    |                            |
| HAL_I2S_RxCpltCallback        |                      |          x         |                            |
| HAL_I2S_TxRxCpltCallback      |                      |                    |              x             |
| HAL_I2S_ErrorCallback         |           x          |          x         |              x             |

| Process API \n \ \n Callbacks  | HAL_I2S_Transmit_DMA  | HAL_I2S_Receive_DMA  | HAL_I2S_TransmitReceive_DMA |
|--------------------------------|:---------------------:|:--------------------:|:---------------------------:|
| HAL_I2S_TxHalfCpltCallback*    |           x           |                      |                             |
| HAL_I2S_TxCpltCallback         |           x           |                      |                             |
| HAL_I2S_RxHalfCpltCallback*    |                       |           x          |                             |
| HAL_I2S_RxCpltCallback         |                       |           x          |                             |
| HAL_I2S_TxRxHalfCpltCallback*  |                       |                      |              x              |
| HAL_I2S_TxRxCpltCallback       |                       |                      |              x              |
| HAL_I2S_ErrorCallback**        |           x           |           x          |              x              |
@note * these callbacks might be called following DMA IRQ management, not I2Sx IRQ management.
@note ** these callbacks might be called following DMA IRQ management, or I2Sx IRQ management.

| Process API \n \ \n Callbacks      | HAL_I2S_Abort_IT  |
|------------------------------------|:-----------------:|
| HAL_I2S_AbortCpltCallback          |         x         |
| HAL_I2S_ErrorCallback              |         x         |

  */

/**
  * @brief Handle I2S interrupt request.
  * @param hi2s Pointer to @ref hal_i2s_handle_t.
  */
void HAL_I2S_IRQHandler(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  uint32_t i2sier = p_i2sx->IER;
  uint32_t i2ssr = p_i2sx->SR;
  uint32_t trigger = i2sier & i2ssr;
  volatile uint32_t count;
  hal_i2s_mode_t mode;

  if (hi2s->global_state == HAL_I2S_STATE_ABORT)
  {
    mode = (hal_i2s_mode_t)LL_I2S_GetTransferMode(p_i2sx);

    /* Compute software timeout based on system core clock */
    count = I2S_DEFAULT_TIMEOUT_MS * (SystemCoreClock / 24U / 1000U);

    if (IS_I2S_MODE_MASTER(mode))
    {
      /* Suspend current transfer */
      LL_I2S_SuspendTransfer(p_i2sx);

      /* Wait for communication to stop */
      do
      {
        count--;
        if (count == 0UL)
        {
          hi2s->global_state = HAL_I2S_STATE_IDLE;
          break;
        }
      } while (LL_I2S_IsActiveTransfer(p_i2sx) != 0U);
    }

    /* Proceed with abort procedure */
    I2S_AbortTransfer(hi2s);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

    /* Call application Abort complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    hi2s->p_abort_cplt_cb(hi2s);
#else
    HAL_I2S_AbortCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }
  else
  {
    if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_DXP))
    {
      hi2s->p_tx_isr(hi2s);
      hi2s->p_rx_isr(hi2s);
    }

    if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_RXP) && STM32_IS_BIT_CLR(trigger, LL_I2S_FLAG_DXP))
    {
      hi2s->p_rx_isr(hi2s);
    }

    if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_TXP) && STM32_IS_BIT_CLR(trigger, LL_I2S_FLAG_DXP))
    {
      hi2s->p_tx_isr(hi2s);
    }
  }

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_UDR))
  {
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));

    LL_I2S_ClearFlag_UDR(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_UDR);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    hi2s->p_error_cb(hi2s);
#else
    HAL_I2S_ErrorCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }

  /* I2S Overrun error interrupt occurred */
  if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_OVR))
  {
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));

    LL_I2S_ClearFlag_OVR(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_OVR);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    hi2s->p_error_cb(hi2s);
#else
    HAL_I2S_ErrorCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  /* I2S Frame error interrupt occurred */
  if (STM32_IS_BIT_SET(trigger, LL_I2S_FLAG_TIFRE))
  {
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));

    LL_I2S_ClearFlag_FRE(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_FRE);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    hi2s->p_error_cb(hi2s);
#else
    HAL_I2S_ErrorCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }
}

/**
  * @brief   I2S Error callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_ErrorCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_ErrorCallback in the user file when needed.
   */
}

/**
  * @brief   Tx transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_TxCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_TxCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Rx transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_RxCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_RxCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Tx and Rx transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_TxRxCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_TxRxCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Tx half transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_TxHalfCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

