MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  /* WARNING: Do not modify this function. Implement the HAL_I2S_TxHalfCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Rx half transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_RxHalfCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_RxHalfCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Tx and Rx half transfer complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_TxRxHalfCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_TxRxHalfCpltCallback in the user file when needed.
   */
}

/**
  * @brief   Abort complete callback.
  * @param   hi2s Pointer to @ref hal_i2s_handle_t.
  * @warning Do not modify this weak function. Implement the callback in the user file when needed.
  */
__weak void HAL_I2S_AbortCpltCallback(hal_i2s_handle_t *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hi2s);

  /* WARNING: Do not modify this function. Implement the HAL_I2S_AbortCpltCallback in the user file when needed.
   */
}

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the Error callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Error callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterErrorCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Tx complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Tx complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterTxCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_tx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Rx complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Rx complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterRxCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Tx/Rx complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Tx/Rx complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterTxRxCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_tx_rx_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Tx half complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Tx half complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterTxHalfCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_tx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Rx half complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Rx half complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterRxHalfCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_rx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Tx/Rx half complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Tx/Rx half complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterTxRxHalfCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hi2s->p_tx_rx_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the Abort complete callback.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  p_callback Pointer to the Abort complete callback function.
  * @retval HAL_INVALID_PARAM Invalid Callback pointer.
  * @retval HAL_OK Register completed successfully.
  */
hal_status_t HAL_I2S_RegisterAbortCpltCallback(hal_i2s_handle_t *hi2s, hal_i2s_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(hi2s->global_state, HAL_I2S_STATE_INIT | HAL_I2S_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

