MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  hi2s->p_abort_cplt_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup I2S_Exported_Functions_Group7 Peripheral current frequency, state and errors functions
  * @{
  * This subsection provides functions to read peripheral current frequency, current state
  * and last occurred errors.
  *  - HAL_I2S_GetClockFreq() function to retrieve the current clock frequency of the I2S peripheral.
  *  - HAL_I2S_GetState() function to retrieve the current state of the I2S peripheral.
  *  - HAL_I2S_GetLastErrorCodes() function to retrieve the error codes in case of HAL_ERROR return
  *    available under the compilation switch USE_HAL_I2S_GET_LAST_ERRORS.
  */

/**
  * @brief  Return the peripheral clock frequency for I2S.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval uint32_t Frequency in Hz.
  * @retval 0 Source clock of the hi2s not configured or not ready.
  */
uint32_t HAL_I2S_GetClockFreq(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle & config allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  return HAL_RCC_SPI_GetKernelClkFreq(I2S_GET_INSTANCE(hi2s));
}

/**
  * @brief  Retrieve the I2S handle state.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @return hal_i2s_state_t I2S state.
  */
hal_i2s_state_t HAL_I2S_GetState(const hal_i2s_handle_t *hi2s)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  /* Return I2S handle state */
  return hi2s->global_state;
}

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the I2S errors codes.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval uint32_t Returned value can be a combination of the following values:
  *         @arg HAL_I2S_ERROR_NONE
  *         @arg HAL_I2S_ERROR_OVR
  *         @arg HAL_I2S_ERROR_UDR
  *         @arg HAL_I2S_ERROR_DMA
  *         @arg HAL_I2S_ERROR_FRE
  *         @arg HAL_I2S_ERROR_IO_LOCKED
  */
uint32_t HAL_I2S_GetLastErrorCodes(const hal_i2s_handle_t *hi2s)
{
  /* Check the I2S handle */
  ASSERT_DBG_PARAM(hi2s != (void *)NULL);

  /* Check the state */
  ASSERT_DBG_STATE(hi2s->global_state, (HAL_I2S_STATE_IDLE           \
                                        | HAL_I2S_STATE_TX_ACTIVE    \
                                        | HAL_I2S_STATE_RX_ACTIVE    \
                                        | HAL_I2S_STATE_TX_RX_ACTIVE \
                                        | HAL_I2S_STATE_PAUSED       \
                                        | HAL_I2S_STATE_ABORT        \
                                        | HAL_I2S_STATE_INIT));

  return hi2s->last_error_codes;
}
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup I2S_Exported_Functions_Group8 Acquire/release Bus functions
  * @{
  * This subsection provides functions to acquire/release the bus based on the HAL OS
  * abstraction layer (stm32_hal_os.c/.h osal):

  * - Call HAL_I2S_AcquireBus() from thread mode only (not from handler mode, i.e., from ISR).
  * - Call HAL_I2S_ReleaseBus() from thread mode or from handler mode, i.e., from ISR.
 */
/**
  * @brief  Acquire the I2S bus using the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param  timeout_ms Time to wait before the bus is occupied by the handle.
  * @note   Call HAL_I2S_AcquireBus from thread mode only (not from handler mode, i.e., from ISR).
  * @retval HAL_OK Operation started successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_I2S_AcquireBus(hal_i2s_handle_t *hi2s, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  if (HAL_OS_SemaphoreTake(&hi2s->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the I2S bus thanks to the HAL OS abstraction layer (stm32_hal_os.c/.h osal).
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @note   The HAL_I2S_ReleaseBus function can be called from thread mode or from handler mode i.e from ISR.
  * @retval HAL_OK Operation started successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_I2S_ReleaseBus(hal_i2s_handle_t *hi2s)
{
  hal_status_t status = HAL_ERROR;

  /* Check the parameters */
  ASSERT_DBG_PARAM(hi2s != NULL);

  if (HAL_OS_SemaphoreRelease(&hi2s->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_I2S_USER_DATA) && (USE_HAL_I2S_USER_DATA == 1)
/** @defgroup I2S_Exported_Functions_Group9 Set/Get user data
  * @{
  * A set of functions to manage a user data pointer stored in the I2S handle:
  *  - HAL_I2S_SetUserData() Set the user data in the handle
  *  - HAL_I2S_GetUserData() Get the user data from the handle
  */

/**
  * @brief Store the user data pointer in the handle.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t.
  * @param p_user_data Pointer to the user data.
  */
void HAL_I2S_SetUserData(hal_i2s_handle_t *hi2s, const void *p_user_data)
{
  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  hi2s->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data pointer from the handle.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t.
  * @retval Pointer to the user data.
  */
const void *HAL_I2S_GetUserData(const hal_i2s_handle_t *hi2s)
{
  /* Check parameters allocation */
  ASSERT_DBG_PARAM(hi2s != NULL);

  return (hi2s->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_I2S_USER_DATA */
/**
  * @}
  */

/** @addtogroup I2S_Private_Functions I2S Private Functions
  * @{
  */
#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
/**
  * @brief DMA I2S transmit process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure that contains
  *             the configuration information for the specified DMA module.
  */
static void I2S_DMATxCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hi2s->hdma_tx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_UDR
                              | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    /* Disable Tx DMA Request */
    LL_I2S_DisableDMAReq_TX(p_i2sx);
    hi2s->tx_xfer_count = (uint16_t)0U;

    I2S_WaitTxFifoEmpty(hi2s);
    LL_I2S_Disable(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;
  }

  /* Call application Tx complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_tx_cplt_cb(hi2s);
#else
  HAL_I2S_TxCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S transmit process half complete callback.
  * @param  hdma pointer to a hal_dma_handle_t structure that contains
  *         the configuration information for the specified DMA module.
  */
static void I2S_DMATxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  /* Call application Tx half complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_tx_half_cplt_cb(hi2s);
#else
  HAL_I2S_TxHalfCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S receive process complete callback.
  * @param  hdma pointer to a hal_dma_handle_t structure that contains
  *         the configuration information for the specified DMA module.
  */
static void I2S_DMARxCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hi2s->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_UDR
                              | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    /* Disable Rx DMA Request */
    LL_I2S_DisableDMAReq_RX(p_i2sx);
    hi2s->rx_xfer_count = (uint16_t)0U;

    LL_I2S_Disable(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;
  }

  /* Call application Rx complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_rx_cplt_cb(hi2s);
#else
  HAL_I2S_RxCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S receive process half complete callback.
  * @param  hdma pointer to a hal_dma_handle_t structure that contains
  *         the configuration information for the specified DMA module.
  */
static void I2S_DMARxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  /* Call application Rx half complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_rx_half_cplt_cb(hi2s);
#else
  HAL_I2S_RxHalfCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S transmit receive process complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void I2S_DMATxRxCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hi2s->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_UDR
                              | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    /* Disable Tx DMA Request */
    LL_I2S_DisableDMAReq_TX(p_i2sx);
    hi2s->tx_xfer_count = (uint16_t)0U;

    /* Disable Rx DMA Request */
    LL_I2S_DisableDMAReq_RX(p_i2sx);
    hi2s->rx_xfer_count = (uint16_t)0U;

    I2S_WaitTxFifoEmpty(hi2s);
    LL_I2S_Disable(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;
  }

  /* Call application TxRx complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_tx_rx_cplt_cb(hi2s);
#else
  HAL_I2S_TxRxCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S transmit receive process half complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void I2S_DMATxRxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

