MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  /* Call application TxRx half complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_tx_rx_half_cplt_cb(hi2s);
#else
  HAL_I2S_TxRxHalfCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA I2S communication error callback.
  * @param  hdma Pointer to a hal_dma_handle_t structure that contains
  *              the configuration information for the specified DMA module.
  */
static void I2S_DMAError(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

  /* Disable Rx and Tx DMA Request */
  LL_I2S_Disable(p_i2sx);
  LL_I2S_DisableDMAReq_RX(p_i2sx);
  LL_I2S_DisableDMAReq_TX(p_i2sx);
  hi2s->tx_xfer_count = (uint16_t) 0UL;
  hi2s->rx_xfer_count = (uint16_t) 0UL;

  hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
  /* Set the error code and execute error callback*/
  STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_DMA);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */

  /* Call application error callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_error_cb(hi2s);
#else
  HAL_I2S_ErrorCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief   DMA I2S Tx communication abort callback, when initiated by the application.
  *          (To be called at end of DMA Tx abort procedure following the application abort request).
  * @param   hdma DMA handle.
  * @warning When this callback is executed, the Abort complete callback is called only if no
  *          abort is still ongoing for the Rx DMA handle.
  */
static void I2S_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  /* Call the Abort procedure */
  I2S_AbortTransfer(hi2s);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_abort_cplt_cb(hi2s);
#else
  HAL_I2S_AbortCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief   DMA I2S Rx communication abort callback, when initiated by the application.
  *          (To be called at end of DMA Rx abort procedure following the application abort request).
  * @param   hdma DMA handle.
  * @warning When this callback is executed, the Abort complete callback is called only if no
  *          abort is still ongoing for the Tx DMA handle.
  */
static void I2S_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  /* Call the Abort procedure */
  I2S_AbortTransfer(hi2s);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
  hi2s->p_abort_cplt_cb(hi2s);
#else
  HAL_I2S_AbortCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
}

/**
  * @brief   DMA I2S Tx Rx communication abort callback, when initiated by the application.
  *          (To be called at end of DMA Tx Rx abort procedure following the application abort request).
  * @param   hdma DMA handle.
  * @warning When this callback is executed, the Abort complete callback is called only if no
  *          abort is still ongoing for the DMA handle.
  */
static void I2S_DMATxRxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_i2s_handle_t *hi2s = (hal_i2s_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;

  hi2s->hdma_rx->p_xfer_abort_cb = I2S_DMARxAbortCallback;

  (void)HAL_DMA_Abort_IT(hi2s->hdma_rx);
}
#endif /* USE_HAL_I2S_DMA */

/**
  * @brief  Manage the transmission 16-bit in Interrupt context.
  * @param  hi2s pointer to a @ref hal_i2s_handle_t.
  */
static void I2S_Transmit_16Bit_IT(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

  if (hi2s->tx_xfer_count != 0UL)
  {
    LL_I2S_TransmitData16(p_i2sx, (*hi2s->p_tx_buff));
    hi2s->p_tx_buff++;
    hi2s->tx_xfer_count--;
  }
  else
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_UDR
                              | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    if (hi2s->global_state == HAL_I2S_STATE_TX_ACTIVE)
    {
      I2S_WaitTxFifoEmpty(hi2s);

      LL_I2S_Disable(p_i2sx);

      hi2s->global_state = HAL_I2S_STATE_IDLE;

      /* Call application Tx complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
      hi2s->p_tx_cplt_cb(hi2s);
#else
      HAL_I2S_TxCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  Manage the transmission 32-bit in Interrupt context.
  * @param  hi2s pointer to a @ref hal_i2s_handle_t.
  */
static void I2S_Transmit_32Bit_IT(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

  if (hi2s->tx_xfer_count != 0UL)
  {
    LL_I2S_TransmitData32(p_i2sx, (*((const uint32_t *)hi2s->p_tx_buff)));
    hi2s->p_tx_buff += 2U;
    hi2s->tx_xfer_count--;
  }
  else
  {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_UDR
                              | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
    LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

    if (hi2s->global_state == HAL_I2S_STATE_TX_ACTIVE)
    {
      I2S_WaitTxFifoEmpty(hi2s);

      LL_I2S_Disable(p_i2sx);

      hi2s->global_state = HAL_I2S_STATE_IDLE;

      /* Call application Tx complete callback */
#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
      hi2s->p_tx_cplt_cb(hi2s);
#else
      HAL_I2S_TxCpltCallback(hi2s);
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
    }
  }
}

/**
  * @brief  Manage the reception 16-bit in Interrupt context.
  * @param  hi2s pointer to a @ref hal_i2s_handle_t.
  */
static void I2S_Receive_16Bit_IT(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  hal_i2s_state_t tmp_global_state = hi2s->global_state;

  (*((uint16_t *)hi2s->p_rx_buff)) = LL_I2S_ReceiveData16(p_i2sx);
  hi2s->p_rx_buff++;
  hi2s->rx_xfer_count--;

