MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  if (hi2s->rx_xfer_count == 0U)
  {
    if (hi2s->global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TXP | LL_I2S_IT_DXP
                                | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */
    }
    else
    {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */
    }

    if (hi2s->global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      I2S_WaitTxFifoEmpty(hi2s);
    }

    LL_I2S_Disable(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    if (tmp_global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      hi2s->p_tx_rx_cplt_cb(hi2s);
    }
    else
    {
      hi2s->p_rx_cplt_cb(hi2s);
    }
#else
    if (tmp_global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      HAL_I2S_TxRxCpltCallback(hi2s);
    }
    else
    {
      HAL_I2S_RxCpltCallback(hi2s);
    }
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Manage the reception 32-bit in Interrupt context.
  * @param  hi2s pointer to a @ref hal_i2s_handle_t.
  */
static void I2S_Receive_32Bit_IT(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  hal_i2s_state_t tmp_global_state = hi2s->global_state;

  (*((uint32_t *)hi2s->p_rx_buff)) = LL_I2S_ReceiveData32(p_i2sx);
  hi2s->p_rx_buff += 2U;
  hi2s->rx_xfer_count--;

  if (hi2s->rx_xfer_count == 0UL)
  {
    if (hi2s->global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TXP | LL_I2S_IT_DXP
                                | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TXP | LL_I2S_IT_DXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

      I2S_WaitTxFifoEmpty(hi2s);
    }
    else
    {
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_UDR | LL_I2S_IT_OVR | LL_I2S_IT_TIFRE));
#else
      LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_RXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */
    }

    LL_I2S_Disable(p_i2sx);

    hi2s->global_state = HAL_I2S_STATE_IDLE;

#if defined(USE_HAL_I2S_REGISTER_CALLBACKS) && (USE_HAL_I2S_REGISTER_CALLBACKS == 1)
    if (tmp_global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      hi2s->p_tx_rx_cplt_cb(hi2s);
    }
    else
    {
      hi2s->p_rx_cplt_cb(hi2s);
    }
#else
    if (tmp_global_state == HAL_I2S_STATE_TX_RX_ACTIVE)
    {
      HAL_I2S_TxRxCpltCallback(hi2s);
    }
    else
    {
      HAL_I2S_RxCpltCallback(hi2s);
    }
#endif /* USE_HAL_I2S_REGISTER_CALLBACKS */
  }
}

/**
  * @brief Abort Transfer and clear flags.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t.
  */
static void I2S_AbortTransfer(const hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);

  /* Disable I2S peripheral */
  LL_I2S_Disable(p_i2sx);

#if defined(USE_HAL_I2S_DMA) && (USE_HAL_I2S_DMA == 1)
  /* Disable DMA request */
  LL_I2S_DisableDMAReq_TX(p_i2sx);
  LL_I2S_DisableDMAReq_RX(p_i2sx);
#endif /* USE_HAL_I2S_DMA */

  /* Clear the error flags in the SR register */
#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  LL_I2S_ClearFlag_OVR(p_i2sx);
  LL_I2S_ClearFlag_UDR(p_i2sx);
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */
  LL_I2S_ClearFlag_SUSP(p_i2sx);
  LL_I2S_ClearFlag_FRE(p_i2sx);
}

/**
  * @brief  Close Transfer and clear flags.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t structure which contains
  *              the I2S instance.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
static hal_status_t I2S_CloseTransfer(hal_i2s_handle_t *hi2s)
{
  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  hal_status_t status = HAL_OK;

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_OVR
                            | LL_I2S_IT_UDR | LL_I2S_IT_TIFRE));
#else
  LL_I2S_DisableIT(p_i2sx, (LL_I2S_IT_TXP | LL_I2S_IT_RXP | LL_I2S_IT_TIFRE));
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

#if defined(USE_HAL_I2S_OVR_UDR_ERRORS) && (USE_HAL_I2S_OVR_UDR_ERRORS == 1)
  /* Report UnderRun error for non RX Only communication */
  if (hi2s->global_state != HAL_I2S_STATE_RX_ACTIVE)
  {
    if (LL_I2S_IsActiveFlag_UDR(p_i2sx) != 0U)
    {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_UDR);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
      LL_I2S_ClearFlag_UDR(p_i2sx);
    }
  }

  /* Report OverRun error for non TX Only communication */
  if (hi2s->global_state != HAL_I2S_STATE_TX_ACTIVE)
  {
    if (LL_I2S_IsActiveFlag_OVR(p_i2sx) != 0U)
    {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
      STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_OVR);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
      LL_I2S_ClearFlag_OVR(p_i2sx);
    }
  }
#endif /* USE_HAL_I2S_OVR_UDR_ERRORS */

  /* I2S frame error interrupt occurred */
  if (LL_I2S_IsActiveFlag_FRE(p_i2sx) != 0U)
  {
#if defined(USE_HAL_I2S_GET_LAST_ERRORS) && (USE_HAL_I2S_GET_LAST_ERRORS == 1)
    STM32_SET_BIT(hi2s->last_error_codes, HAL_I2S_ERROR_FRE);
#endif /* USE_HAL_I2S_GET_LAST_ERRORS */
    LL_I2S_ClearFlag_FRE(p_i2sx);
    status = HAL_ERROR;
  }

  /* Wait TX FIFO empty if TX direction is used */
  if (hi2s->global_state != HAL_I2S_STATE_RX_ACTIVE)
  {
    I2S_WaitTxFifoEmpty(hi2s);
  }

  LL_I2S_Disable(p_i2sx);

  hi2s->global_state = HAL_I2S_STATE_IDLE;

