MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2s.c
  return status;
}

/**
  * @brief  Compute the Word Select audio frequency following register configuration.
  * @param  hi2s Pointer to a @ref hal_i2s_handle_t structure which contains
  *              the I2S instance.
  * @param  i2s_clk_hz Value of the I2S kernel clock.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
static hal_i2s_master_audio_frequency_t I2S_GetAudioFrequency(const hal_i2s_handle_t *hi2s, uint32_t i2s_clk_hz)
{
  uint32_t real_audio_frequency_ws_hz = 0U;
  uint32_t ispcm = 0U;
  uint32_t channel_length = 1U;
  uint32_t index_freq = 0U;
  uint32_t tmp_index_freq = 0U;
  uint32_t min_diff_freq = 0U;
  uint32_t diff_freq = 0U;
  uint32_t prescaler = 1U;

  const uint32_t audio_frequencies[I2S_NUMBER_FREQUENCY] = {(uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_8_KHZ,  \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_11_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_16_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_22_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_32_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_44_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_48_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_96_KHZ, \
                                                            (uint32_t)HAL_I2S_MASTER_AUDIO_FREQ_192_KHZ
                                                           };

  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  uint32_t i2scfgr_reg_value = (uint32_t)(LL_I2S_READ_REG((p_i2sx), I2SCFGR));
  hal_i2s_standard_t standard = (hal_i2s_standard_t)((uint32_t)(i2scfgr_reg_value
                                                                & (SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC)));
  hal_i2s_data_format_t data_format = (hal_i2s_data_format_t)((uint32_t)(i2scfgr_reg_value
                                                                         & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN)));
  uint32_t mckoe = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_MCKOE) >> SPI_I2SCFGR_MCKOE_Pos));
  uint32_t i2s_odd = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_ODD) >> SPI_I2SCFGR_ODD_Pos));
  uint32_t i2s_div = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_I2SDIV) >> SPI_I2SCFGR_I2SDIV_Pos));

  if (i2s_div != 0U)
  {
    prescaler = (uint32_t)((2U * i2s_div) + i2s_odd);
  }

  if (IS_I2S_STANDARD_PCM(standard))
  {
    ispcm = 1U;
  }

  if (IS_I2S_CHANNEL_LENGTH_32_BIT(data_format))
  {
    /* Channel length is 32 bits */
    channel_length = 2U;
  }

  /* Reference Manual, SPI/I2S section, Chapter Clock generator:
  Depending on the master clock state (MCKOE = 0 or MCKOE = 1), the frequency of the frame
  synchronization is given by the following formulas */
  if (mckoe != 0U)
  {
    real_audio_frequency_ws_hz = (uint32_t)(i2s_clk_hz / (((uint32_t)(256UL >> ispcm)) * prescaler));
  }
  else
  {
    real_audio_frequency_ws_hz = (uint32_t)(i2s_clk_hz / ((((uint32_t)(32UL >> ispcm)) * channel_length) * prescaler));
  }

  /* Find the difference between the lowest audio frequency and the real frequency */
  if (real_audio_frequency_ws_hz > audio_frequencies[0])
  {
    min_diff_freq = (real_audio_frequency_ws_hz - audio_frequencies[0]);
  }
  else
  {
    min_diff_freq = (audio_frequencies[0] - real_audio_frequency_ws_hz);
  }

  /* Parse all the audio frequencies to find the closest to the real frequency */
  for (tmp_index_freq = 1U; tmp_index_freq < I2S_NUMBER_FREQUENCY; tmp_index_freq++)
  {
    if (real_audio_frequency_ws_hz > audio_frequencies[tmp_index_freq])
    {
      diff_freq = (real_audio_frequency_ws_hz - audio_frequencies[tmp_index_freq]);
    }
    else
    {
      diff_freq = (audio_frequencies[tmp_index_freq] - real_audio_frequency_ws_hz);
    }

    /* Update smallest difference found */
    if (diff_freq < min_diff_freq)
    {
      min_diff_freq = diff_freq;
      index_freq = tmp_index_freq;
    }
  }

  return (hal_i2s_master_audio_frequency_t)audio_frequencies[index_freq];
}

/**
  * @brief Compute prescaler following register configuration and Word Select audio frequency.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t structure which contains
  *             the I2S instance.
  * @param i2s_clk_hz Value of the I2S kernel clock.
  * @param audio_frequency_ws_hz Value of the word select audio frequency in Hz.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
static hal_status_t I2S_SetAudioFrequency(const hal_i2s_handle_t *hi2s, uint32_t i2s_clk_hz,
                                          hal_i2s_master_audio_frequency_t audio_frequency_ws_hz)
{
  uint32_t i2s_prescaler = 0U;
  uint32_t ispcm = 0U;
  uint32_t channel_length = 1U;
  uint32_t i2s_div = 2U;
  uint32_t i2s_odd = 0U;

  SPI_TypeDef *p_i2sx = I2S_GET_INSTANCE(hi2s);
  uint32_t i2scfgr_reg_value = (uint32_t)(LL_I2S_READ_REG((p_i2sx), I2SCFGR));
  hal_i2s_standard_t standard = (hal_i2s_standard_t)((uint32_t)(i2scfgr_reg_value
                                                                & (SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC)));
  hal_i2s_data_format_t data_format = (hal_i2s_data_format_t)((uint32_t)(i2scfgr_reg_value
                                                                         & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN)));
  uint32_t mckoe = ((uint32_t)((i2scfgr_reg_value & SPI_I2SCFGR_MCKOE) >> SPI_I2SCFGR_MCKOE_Pos));

  if ((uint32_t)audio_frequency_ws_hz == 0U)
  {
    return HAL_ERROR;
  }

  if (IS_I2S_MASTER_AUDIO_FREQUENCY(audio_frequency_ws_hz))
  {
    if (IS_I2S_STANDARD_PCM(standard))
    {
      ispcm = 1U;
    }

    if (IS_I2S_CHANNEL_LENGTH_32_BIT(data_format))
    {
      /* Channel length is 32 bits */
      channel_length = 2U;
    }

    /* Reference Manual, SPI/I2S section, Chapter Clock generator:
    Depending on the master clock state (MCKOE = 0 or MCKOE = 1), the frequency of the frame
    synchronization is given by the following formulas */
    if (mckoe != 0U)
    {
      i2s_prescaler = (uint32_t)((((i2s_clk_hz / ((uint32_t)(256UL >> ispcm))) * 10U)
                                  / ((uint32_t)audio_frequency_ws_hz)) + 5U);
    }
    else
    {
      i2s_prescaler = (uint32_t)((((i2s_clk_hz / (((uint32_t)(32UL >> ispcm)) * channel_length)) * 10U)
                                  / ((uint32_t)audio_frequency_ws_hz)) + 5U);
    }

    /* Remove the floating point */
    i2s_prescaler = i2s_prescaler / 10U;

    /* Check the parity of the divider */
    i2s_odd = (uint32_t)(i2s_prescaler & (uint32_t)1U);

    /* Compute the i2sdiv prescaler */
    i2s_div = (uint32_t)((i2s_prescaler - i2s_odd) / 2U);

    /* Test if the obtain values are forbidden or out of range */
    if (((i2s_odd == 1U) && (i2s_div == 1U)) || (i2s_div > 0xFFU))
    {
      return HAL_ERROR;
    }

    /* Force i2smod to 1 just to be sure that (2xi2sdiv + i2sodd) is always higher than 0 */
    if (i2s_div == 0U)
    {
      i2s_odd = 1U;
    }
  }

  LL_I2S_SetPrescaler(p_i2sx, i2s_div, i2s_odd);

  return HAL_OK;
}

/**
  * @brief Wait for Tx FIFO to be completely empty.
  * @param hi2s Pointer to a @ref hal_i2s_handle_t structure which contains
  *             the I2S instance.
  */
static void I2S_WaitTxFifoEmpty(hal_i2s_handle_t *hi2s)
{
  volatile uint32_t count;
  uint32_t i2s_kernel_divider;
  uint32_t i2s_kernel_clock = HAL_RCC_SPI_GetKernelClkFreq(I2S_GET_INSTANCE(hi2s));
  uint32_t i2s_prescaler;
  hal_i2s_mode_t mode = (hal_i2s_mode_t)LL_I2S_GetTransferMode(I2S_GET_INSTANCE(hi2s));

  if (i2s_kernel_clock != 0U)
  {
    /* I2S presecaler is equal to (2* i2s_div) + odd */
    if (IS_I2S_MODE_MASTER(mode))
    {
      i2s_prescaler = (2U * LL_I2S_GetPrescalerLinear(I2S_GET_INSTANCE(hi2s)))
                      + LL_I2S_GetPrescalerParity(I2S_GET_INSTANCE(hi2s));
    }
    else
    {
      /* Worst case for slave mode */
      i2s_prescaler = (uint32_t)((((i2s_kernel_clock / (((uint32_t)(16)) * 2U))) / ((uint32_t)8000)));
    }

    /* Calculation of ratio between SystemCoreClock and I2S kernel Clock
    up to the nearest multiple of the divisor */
    i2s_kernel_divider = (((SystemCoreClock) + ((i2s_kernel_clock) - 1U)) / (i2s_kernel_clock));

    /* Number of SystemCoreClock cycles to flush data inside FIFO */
    count = ((I2S_FIFO_SIZE_BYTE * i2s_kernel_divider * i2s_prescaler) / 3U) * 16U;

    /* Wait loop: 3 to 4 SystemCoreClock cycles to execute each loop. Depending on pipeline */
    do
    {
      count--;
    } while (count != 0U);
  }
}

/**
  * @}
  */

#endif /* USE_HAL_I2S_MODULE */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
